[
{"title": "Tivoli technical training", "description": []},
{"title": "Support information", "description": ["<p>If you have a problem with your IBM software, you want to resolve it quickly.\r\nIBM provides the following ways for you to obtain the support you need:</p>", "<p>For more information about these three ways of resolving problems, see <a href=\"bsms101.htm#supportinfo\">Support information</a>.</p>"]},
{"title": "Participating in newsgroups", "description": ["<p>User groups provide software professionals with a forum for communicating\r\nideas, technical expertise, and experiences related to the product.  They\r\nare located on the Internet and are available using standard news reader programs.\r\n These groups are primarily intended for user-to-user communication and are\r\nnot a replacement for formal support.</p>", "<p>To access a newsgroup, use the instructions appropriate for your browser.</p>", "<p>IBM<sup>(R)</sup> Tivoli<sup>(R)</sup> Business Systems Manager:</p>", "<p><a href=\"news://news.software.ibm.com/ibm.software.tivoli.business-systems-manager\">news://news.software.ibm.com/ibm.software.tivoli.business-systems-manager</a></p>", "<p>IBM Tivoli Enterprise Console<sup>(R)</sup>:</p>", "<p><a href=\"news://news.software.ibm.com/ibm.software.tivoli.enterprise-console\">news://news.software.ibm.com/ibm.software.tivoli.enterprise-console</a></p>", "<p>IBM Tivoli Service Level Advisor:</p>", "<p><a href=\"news://news.software.ibm.com/ibm.software.tivoli.service-level-advisor\">news://news.software.ibm.com/ibm.software.tivoli.service-level-advisor</a></p>", "<p>IBM Tivoli Switch Analyzer:</p>", "<p><a href=\"news://news.software.ibm.com/ibm.software.tivoli.switch-analyzer\">news://news.software.ibm.com/ibm.software.tivoli.switch-analyzer</a></p>", "<p>IBM Tivoli NetView<sup>(R)</sup> for UNIX<sup>(R)</sup> and IBM Tivoli NetView for Windows<sup>(R)</sup>:</p>", "<p><a href=\"news://news.software.ibm.com/ibm.software.tivoli.netview-unix-windows\">news://news.software.ibm.com/ibm.software.tivoli.netview-unix-windows</a></p>", "<p>IBM Tivoli NetView for z/OS<sup>(R)</sup>:</p>", "<p><a href=\"news://news.software.ibm.com/ibm.software.netview\">news://news.software.ibm.com/ibm.software.netview</a></p>"]},
{"title": "Conventions used in this guide", "description": ["<p>This guide uses several conventions for special terms and actions and for\r\noperating system-dependent commands and paths</p>"]},
{"title": "Typeface conventions", "description": ["<p>This guide uses the following typeface conventions:</p>"]},
{"title": "Operating system-dependent variables and paths", "description": ["<p><a id=\"idx27\" name=\"idx27\"></a><a id=\"idx28\" name=\"idx28\"></a>This guide uses the UNIX<sup>(R)</sup> convention for specifying environment\r\nvariables and for directory notation.</p>", "<p>When using the Windows<sup>(R)</sup> command line, replace <span class=\"bold\">$</span><var class=\"pv\">variable</var> with <span class=\"bold\">%</span><var class=\"pv\">variable</var><span class=\"bold\">%</span> for environment variables and replace each forward slash (<span class=\"bold\">/</span>) with a backslash (<span class=\"bold\">\\</span>) in directory paths. The\r\nnames of environment variables are not always the same in Windows and UNIX. For example, %TEMP% in Windows is equivalent to $tmp in UNIX.</p>"]},
{"title": "Terminology", "description": ["<p>For a list of terms and definitions for Tivoli<sup>(R)</sup> and other IBM<sup>(R)</sup> products, refer to the IBM terminology\r\nWeb site:</p>", "<p><a href=\"http://http://www.ibm.com/ibm/terminology/\">http://www.ibm.com/ibm/terminology/</a></p>", "<p>For brevity and readability, the term Tivoli NetView<sup>(R)</sup> for z/OS<sup>(R)</sup> refers to both the Tivoli NetView for z/OS product and the Tivoli NetView for OS/390<sup>(R)</sup> product.</p>"]},
{"title": null, "description": ["<p>One of your most difficult tasks in business systems management is choosing\r\nproducts that align IT resources with your business priorities. In an environment\r\nthat includes resources from multiple vendors running on multiple platforms,\r\nunderstanding the status of a particular IT resource is only a small part\r\nof the big picture. To maximize the business value of your IT investments,\r\nyou must also see how each resource affects the applications and business\r\nprocesses that it supports.</p>", "<p><a id=\"idx29\" name=\"idx29\"></a>The Tivoli<sup>(R)</sup> business systems management solution\r\nis a model that helps you understand the components of integrated business\r\nsystems and then identify the Tivoli products that meet those management\r\nneeds. This layered model shown in <a href=\"bsms17.htm#bsmd0011010611\">Figure 1</a> supports\r\nreal-time, predictive management of your enterprise.</p>"]},
{"title": "Integration", "description": ["<p>    Implementing a comprehensive business systems management solution requires\r\ncareful consideration of the roles of each product as well as the integration\r\nbetween the products.</p>", "<p><a id=\"idx31\" name=\"idx31\"></a><a id=\"idx32\" name=\"idx32\"></a>The products in\r\nthe <span class=\"italic\">monitoring systems and applications layer</span> provide\r\nthe information that you need to understand critical problems. These products\r\nuse built-in best practice definitions to define <span class=\"italic\">problem\r\nsignatures</span> that reflect the behavior of a set of related metrics over\r\ntime. The products in this layer can also provide automation as part of the\r\nautonomic model, using automation at the source to attempt to fix a problem\r\nbefore it becomes critical. After the problem is considered critical, an event\r\nis generated and sent to the event correlation and automation layer. When\r\nthe condition is resolved, an event is also sent to clear the initial event.</p>", "<p><a id=\"idx33\" name=\"idx33\"></a><a id=\"idx34\" name=\"idx34\"></a>The products in the<span class=\"italic\"> event correlation and automation layer</span> analyze the raw data from the\r\nmonitoring layer. In the event correlation and automation layer, effective\r\nbusiness management products correlate problem signatures with the systems\r\non which these business-significant events occurred, to determine the root\r\ncause of the problem. These tools might also suppress related events and activate\r\nautomation to determine the root cause or to solve the problem. When a problem\r\nfound in this layer has an impact on your business, the event is forwarded\r\nto the business impact layer. An associated clearing event should be sent\r\nto indicate the end of the impact.</p>", "<p><a id=\"idx35\" name=\"idx35\"></a><a id=\"idx36\" name=\"idx36\"></a>Products in the <span class=\"italic\">business impact management layer</span> define your resources as they relate\r\nto business systems. Using products in this layer, you can interpret business-significant\r\nevents received from the event correlation and automation layer and display\r\nthem in the context of the affected business system.</p>", "<p>For example, when the parameters of a service level agreement are exceeded,\r\na product in the event correlation and automation layer generates an event.\r\nThe business impact of this event is understood and assigned by product in\r\nthe business impact management layer. Then, through the use of products that\r\ncapture and analyze historical trends in this data, you can monitor compliance\r\nto service level agreements and generate the appropriate reports summarizing\r\nthis business data.</p>", "<p>The way that you design and implement your solution is critical.</p>"]},
{"title": "Designing Your Solution", "description": ["<p>To design an effective business systems management solution, think in terms\r\nof the following high-level steps:</p>"]},
{"title": "Understanding the Product Set", "description": ["<p>The Tivoli<sup>(R)</sup> business systems management solution offers products that fulfill\r\nthe functions described in the model. <a href=\"bsms20.htm#bsmd0011010878\">Figure 2</a> shows\r\nthe products associated with each layer.</p>", "<p>These products are explained by layer in the following information.</p>"]},
{"title": "Products in the Business Impact Management Layer", "description": ["<p>The following products support functions performed in the business impact\r\nmanagement layer.</p>", "<p>IBM<sup>(R)</sup> Tivoli<sup>(R)</sup> Business Systems Manager manages z/OS<sup>(R)</sup> and distributed systems and provides\r\na business systems management paradigm for applications management. Using\r\nthe business systems management paradigm, you can manage groups of related\r\napplications that underpin and enable critical business functions, such as\r\nenterprise resource planning or customer relationship management environments.</p>", "<p>Mission-critical business systems present a unique management challenge.\r\nThey typically span host and distributed environments, are comprised of many\r\ninterconnected application components, both commercial and custom, and rely\r\non diverse middleware, databases, and supporting platforms. IBM Tivoli Business\r\nSystems Manager gives you a single point of management and control and provides\r\nend-to-end business systems management to organize related components and\r\ngive business context to management decisions.</p>", "<p>IBM Tivoli Business Systems Manager provides a unique configurable business\r\nview that enables management and control of the multiple integrated software\r\ncomponents required to deliver a specific business service. The product achieves\r\nthis value by using a tool called the <span class=\"italic\">business system</span>.\r\nUsing a business system, the IT staff can view IT resources in the context\r\nof critical business services, prioritize actions based on business impact,\r\nand make intelligent trade-offs. A business system provides a business context\r\nfor IT, enables greater accountability to business user needs, and improves\r\nthe ability to prioritize issues and optimize actions.</p>", "<p>The product also shows and allows the manipulation of the relationships\r\nbetween applications, so that your IT staff can easily spot inefficiencies\r\nand problems and quickly diagnose the root cause of complex failure scenarios,\r\nthereby increasing availability of critical business systems.</p>", "<p>In summary, IBM Tivoli Business Systems Manager helps your business in\r\nthe following ways:</p>", "<p>IBM Tivoli Service Level Advisor provides service level management capabilities\r\nfor providers of IT services. It is designed to simplify the definition of\r\nservice offerings according to the terms of a service level agreement, associating\r\nthe service level agreement with one or more clients. It then automates evaluating\r\nservice level agreements by correlating any monitored metrics stored in a\r\nbuilt-in database, using IBM Tivoli Data Warehouse.</p>", "<p>IBM Tivoli Service Level Advisor provides alerts and historical reports of\r\nservice level agreement violations and trends toward violation. Providers\r\nof IT services who need to measure, manage, and report on the business impact\r\nof their internal IT infrastructure can leverage existing performance and\r\navailability or business process applications. Using IBM Tivoli Service Level Advisor, you can manage\r\nthe information collected by these applications against service level agreements\r\nand internal service level objectives.</p>", "<p> The goal is to provide predictive service level management on any appropriate IBM and Tivoli or independent software application for true end-to-end business impact\r\nmanagement. The events and reports from the IBM Tivoli Service Level Advisor product can help\r\nyou manage costs, justify expense, improve internal customer satisfaction,\r\nand measure the business impact of problems with your enterprise IT infrastructure\r\nin terms of revenue, productivity, and contribution to business success.</p>", "<p>In summary, IBM Tivoli Service Level Advisor helps your business in the\r\nfollowing ways:</p>", "<p>IBM Tivoli Data Warehouse is an embedded technology that provides the backbone\r\nrepository for all historical systems management data and the basis for all Tivoli reporting solutions. As the amount of management data gathered continues\r\nto grow, the data is not being used effectively for IT business-relevant decisions. IBM Tivoli Data Warehouse solves this problem by being the central data store where\r\nhistorical data from all management applications is aggregated and correlated.\r\nThis data is used by the following types of products:</p>", "<p>The objective of the IBM Tivoli Data Warehouse is to provide a consistent historical\r\nreporting infrastructure and interface for all Tivoli applications to use. The warehouse\r\nleverages a proven warehouse schema and DB2 technology. IBM Tivoli Data Warehouse includes restricted-use\r\nlicense versions of IBM DB2 Universal Database<sup>(TM)</sup> Enterprise Server Edition\r\nand IBM DB2 Warehouse Manager.</p>", "<p>The IBM Tivoli Data Warehouse technology provides an open and published data\r\nwarehouse infrastructure so that you can move beyond application-based data\r\nstores to cross-application and business-based trending and analysis.</p>"]},
{"title": "Products in the Event Correlation and Automation Layer", "description": ["<p>The following products support functions performed in the event correlation\r\nand automation layer.</p>", "<p>The IBM<sup>(R)</sup> Tivoli Enterprise Console<sup>(R)</sup> product provides\r\ncross-system, root-cause problem analysis through processing of events generated\r\nfrom various sources, such as the IBM Tivoli<sup>(R)</sup> Monitoring product, simple network\r\nmanagement protocol (SNMP), or custom adapters. By creating rules based on\r\nincoming events, multiple events from different sources can be combined into\r\na single event.</p>", "<p><a id=\"idx51\" name=\"idx51\"></a>The NetView<sup>(R)</sup> Integrated TCP/IP Services Component, a part of the IBM Tivoli Enterprise Console product, discovers TCP/IP networks, displays network topologies, correlates\r\nand manages events and SNMP traps, monitors network health, and gathers performance\r\ndata. The NetView Integrated TCP/IP Services Component meets the needs of managers\r\nof large networks by providing the scalability and flexibility to manage mission-critical\r\nenvironments.</p>", "<p>The IBM Tivoli Enterprise Console provides sophisticated,\r\nautomated problem diagnosis and resolution to improve system performance and\r\nreduce support costs. Recent enhancements focus on time to value and ease\r\nof use with preconfigured best practices to simplify and accelerate deployment.\r\nThe auto-discovery feature makes it easier for you to understand the environment\r\nand process events appropriately. The Web console provides a more visual understanding\r\nof events and also provides remote access to events and console operations.</p>", "<p>In summary, the IBM Tivoli Enterprise Console delivers the following\r\nfeatures: </p>", "<p>IBM Tivoli NetView for z/OS<sup>(R)</sup> provides a comprehensive set of tools\r\nfor maintaining complex, multivendor, multiplatform networks and systems from\r\na single point of control.</p>", "<p>NetView for z/OS provides management functions that work together with\r\nother products or can function alone. NetView for z/OS is a program for managing networks and\r\nsystems through graphical display and automation. It reduces manual resource\r\ndefinition and complex automation setup through production-ready automation\r\nand extends centralized management into multiple non-SNA network environments. NetView for z/OS can be used in an enterprise as a centralized manager,\r\na mid-level manager, or a z/OS management endpoint.</p>", "<p>NetView for z/OS also provides the base automation capabilities for\r\nthe z/OS platform that is used by the IBM Tivoli System Automation for z/OS product.</p>", "<p>IBM Tivoli System Automation for z/OS plays an important role in building an\r\nend-to-end autonomic computing solution. The unique functions of Tivoli System Automation\r\nfor z/OS can help customers with a single z/OS system and or with multiple parallel\r\nsysplex clusters to ease management, reduce costs, and increase availability.\r\n  Tivoli System Automation for z/OS is designed to automate input and output,\r\nprocessor and system operations, and includes predefined automation for the IMS<sup>(TM)</sup>, CICS<sup>(R)</sup>, IBM Tivoli Workload Scheduler, and DB2<sup>(R)</sup> products.</p>", "<p>In summary, System Automation for z/OS delivers the following features: </p>"]},
{"title": "Products in the Monitoring Systems and Applications Layer", "description": ["<p>The following products support functions performed in the monitoring systems\r\nand applications layer.</p>", "<p>At the heart of the Tivoli<sup>(R)</sup> monitoring space is the IBM<sup>(R)</sup> Tivoli Monitoring product. IBM Tivoli Monitoring\r\nis an application that applies preconfigured, automated best practices to\r\nthe monitoring of IT resources. Its main purpose is to apply best practices\r\nlocally at the managed system to determine whether a problem situation exists,\r\nand if so, local automated actions are started to resolve or bypass the problem,\r\nor initiate procedures for collecting problem determination information.</p>", "<p>In summary, IBM Tivoli Monitoring provides the following features: </p>", "<p>IBM Tivoli Monitoring on its own is a powerful technology, but the real value\r\nof this product is the monitoring best practices knowledge that is shipped\r\nin the form of resource models. While the ability to build and customize resource\r\nmodels is seen as a very important function, you might prefer to use that\r\ncapability for extending existing resource models and pay for prebuilt monitoring\r\nsolutions rather than invest in the skills and the time required to build\r\nthem in-house.</p>", "<p>Tivoli products contain monitoring solutions for specific applications\r\nor middleware. The IBM Tivoli Monitoring for Databases product, for example, contains DB2<sup>(R)</sup>,\r\nOracle, and other components. The current set of components includes:</p>", "<p>IBM Tivoli Monitoring for Transaction Performance is focused on monitoring\r\ntransactions across multiple systems. By collecting application resource measurement\r\ndata from applications, the product can determine the location of performance\r\nproblems.</p>", "<p>Tivoli Monitoring for Transaction Performance monitors both the end-to-end\r\nperformance as perceived by end users of applications and the performance\r\nof the steps that make up the transaction. This data is used to monitor and\r\nmanage against service level agreements and can be extracted to the IBM Tivoli Data Warehouse\r\nfor reporting, capacity planning and further analysis.</p>", "<p>IBM Tivoli Monitoring for Network Performance Version 2.1 allows IBM z/OS<sup>(R)</sup> operators to\r\neasily understand how TCP/IP protocol behavior on their monitored critical\r\nsystems is affecting application performance. By distributing network monitors\r\nto all of your z/OS images (across a sysplex, or your entire environment)\r\nand consolidating collected information into a single database, it is easy\r\nfor network system programmers and operators to get information about the\r\nentire environment from a single location to compare notes or gain understanding\r\nof overall performance within the data center. Integrated reporting using\r\nthe IBM Tivoli Data Warehouse allows visibility of historical trending data as\r\nwell as enabling integrated reporting of z/OS TCP/IP data with other information.<a id=\"idx60\" name=\"idx60\"></a></p>", "<p><a id=\"idx61\" name=\"idx61\"></a>Because\r\nSystem Network Architecture (SNA) is still critical in many customer environments, IBM Tivoli Monitoring for Network Performance includes Tivoli NetView<sup>(R)</sup> Performance Monitor (NPM) Version\r\n2.7, providing performance information for SNA networks. Customers using both\r\ntools have performance coverage for both SNA and TCP/IP environments.</p>", "<p>IBM Tivoli Monitoring for Network Performance Version 2.1 monitors, records,\r\nand interactively reports network performance and utilization for TCP/IP resources\r\nin an enterprise environment. It enables the timely analysis of performance-related\r\nmetrics such as response time, traffic flow, and system workload, which can\r\nassist network tuning, problem determination, and validation of service level\r\nagreements.</p>", "<p>IBM Tivoli Monitoring for Network Performance enables you to specify threshold\r\nand rearm values for generating events when specific performance metrics indicate\r\na problem in your network. Events can be displayed on the IBM Tivoli Enterprise Console<sup>(R)</sup> and by IBM Tivoli NetView for z/OS.</p>", "<p>Tivoli Monitoring for Network Performance meets your daily tactical needs\r\nas well as your long-term strategic systems management goals, providing an\r\neffective way to gain control of mission-critical network resources, performance\r\nissues, and workload distributions.</p>"]},
{"title": null, "description": ["<p>This chapter provides an overview of Tivoli<sup>(R)</sup> Business Systems Manager:</p>"]},
{"title": "What Is Tivoli Business Systems Manager?", "description": ["<p><a id=\"idx62\" name=\"idx62\"></a>Tivoli<sup>(R)</sup> Business Systems Manager provides your operations with\r\na view of the system components as they relate to your overall business. It\r\nalso provides your executives with a high level view of the status of predefined\r\nservices in your organization. Use Tivoli Business Systems Manager to perform the following functions: </p>", "<p>Once resources are defined to or discovered by Tivoli Business Systems Manager, they\r\nare available from the Tivoli Business Systems Manager console.  You can build business systems that\r\nspan z/OS resources and distributed resources. You can use the Tivoli Business Systems Manager console\r\nto display the relationship of these resources.   You can use the existing\r\nevent management infrastructure to correlate events.</p>", "<p>Tivoli Business Systems Manager provides an Extract, Transform, and Load routine (ETL)\r\nto add availability data into the data warehouse. Tivoli Service Level Advisor can then build service\r\nlevel agreements (SLAs) based on this data.</p>"]},
{"title": "Business Systems", "description": ["<p>A business system is a group of diverse but interdependent applications\r\nand other system resources that interact to accomplish specific business functions.\r\nIn Tivoli<sup>(R)</sup> Business Systems Manager, the term business system is used to represent a container of resources,\r\n which in turn can contain other business systems or representations of actual\r\nphysical resources.</p>", "<p> A business system can contain applications or other resources that run\r\non a variety of platforms, including host, distributed, and network environments.\r\nFor example, a banking business system designed to support transactions over\r\nthe Web typically includes a Web server running outside the company's\r\nintranet and connected directly to the Internet and a firewall that provides\r\nsecure connectivity to a machine running a custom business component, such\r\nas loan processing. The loan processing business component usually runs on\r\na distributed platform and connects to business components running on a host\r\ncomputer. The host handles all the bank transactions. This business system\r\npresents challenges to a system manager because it crosses the typically isolated\r\nenvironments of host and distributed systems.</p>", "<p>Another example of a business system is an e-mail system. E-mail\r\nbusiness systems include all the instances of e-mail business components that\r\nare being used in your network. You might have a mix of Lotus<sup>(R)</sup> Notes<sup>(R)</sup> servers, POP\r\nmail or Microsoft<sup>(R)</sup> Exchange servers, and other e-mail business\r\ncomponents. An e-mail business system includes these components, as well as\r\ndefinitions of the relationships between them.</p>", "<p>You can create business systems by using the following methods:</p>", "<p>For more information on business systems, see <a href=\"bsms62.htm#imovbus\">Business Systems</a>.</p>"]},
{"title": "Automatically Creating a Business System", "description": ["<p>You can use the Automated Business Systems process to create business\r\nsystems. When the configuration is complete, Tivoli<sup>(R)</sup> Business Systems Manager continues to automatically\r\nadd newly discovered resources to the views based on the criteria associated\r\nwith the views.</p>"]},
{"title": "Creating a Business System using XML", "description": ["<p>The XML toolkit can be used to create business systems in Tivoli<sup>(R)</sup> Business Systems Manager. For example,\r\nif your site uses a repository to contain an inventory of the resources in\r\nyour environment and how they relate to one another with respect to your business\r\nsystems and processes, you can extract the data from the repository and dynamically\r\ncreate and modify business systems using the toolkit.</p>", "<p>You can use the XML toolkit to add, modify, or delete business\r\nsystems based on existing resources. For physical resources to be linked into\r\nthe business systems, they must already exist in the Tivoli Business Systems Manager database. You\r\ncan also use the XML toolkit to backup and restore business systems.</p>", "<p>Refer to the <cite>IBM Tivoli Business Systems Manager Installation and Configuration Guide</cite> for instructions for installing the XML\r\ntoolkit.</p>", "<p>Refer to the <cite>IBM Tivoli Business Systems Manager Administrator's Guide</cite> for the format of the XML file and a sample\r\nfile.</p>"]},
{"title": "Creating a Business System Manually", "description": ["<p>You can create a business system manually from the Tivoli<sup>(R)</sup> Business Systems Manager console. Refer\r\nto the <cite>IBM Tivoli Business Systems Manager Administrator's Guide</cite> for the required steps and for information on adding\r\nresources to the new business system.</p>"]},
{"title": "Physical Resources", "description": ["<p>Physical resources represent the applications, subsystems, and\r\ntechnical devices (such as routers, server machines, and other physical devices)\r\nthat the Tivoli<sup>(R)</sup> Business Systems Manager monitors for availability. Physical resources are defined\r\nin the Tivoli Business Systems Manager database along with identifying information that includes the\r\nresource name and the resource type, as well as other information about the\r\nresource.</p>", "<p>Physical resources are categorized by type. Examples of resource\r\ntypes are IMS<sup>(TM)</sup> transaction, CICS<sup>(R)</sup> region, started task (STC), or a Windows<sup>(R)</sup> server.</p>", "<p>Physical resources are displayed in a hierarchy. The hierarchy\r\nfor z/OS<sup>(R)</sup> resources is predefined. You can configure tables or use the distributed\r\nplacement rules to specify the hierarchy for distributed resources as they\r\nare created.</p>", "<p>For more detailed information on resources, refer to the <cite>IBM Tivoli Business Systems Manager Introducing the Consoles</cite> and\r\nthe task assistant.</p>"]},
{"title": "Discovery Processing", "description": ["<p>Tivoli<sup>(R)</sup> Business Systems Manager accepts events indicating state changes and alerts as\r\nwell as performance characteristics that indicate availability. However, before\r\nyou can manage resources in your enterprise, the resources must be discovered\r\nand registered in the Tivoli Business Systems Manager database. The resource discovery and registration\r\nprocess varies depending on the data source. In some cases, the receipt of\r\nan event triggers the discovery of the resource so that the event can be posted\r\nagainst it. For z/OS<sup>(R)</sup> resources, the operating system as well as its higher\r\nlevel resources must be manually created before events can be received for\r\nresources contained in that z/OS environment.</p>"]},
{"title": "Discovering z/OS Resources", "description": ["<p>Resource discovery is a process that identifies resources. The\r\nprocess for discovering monitored resources in the z/OS<sup>(R)</sup> environment involves detecting the configuration\r\nof the resources and updating the Tivoli<sup>(R)</sup> Business Systems Manager database.</p>", "<p>Tivoli Business Systems Manager has three discovery processes for z/OS resources:</p>", "<p class=\"indatacontent\">The discovery process uses various data sources to initially populate\r\nresources in the Tivoli Business Systems Manager database. The z/OS process involves a series of batch functions\r\nthat create a sequential file, which is forwarded to the Tivoli Business Systems Manager servers. The\r\ndata is then processed and stored in the Tivoli Business Systems Manager database.</p>", "<p>Following the installation and activation of the IMS and DB2 data source,\r\nthe autodiscovery process will identify all eligible resources within DB2 and IMS subsystems.\r\nThese resources are forwarded to the Tivoli Business Systems Manager servers and stored in the Tivoli Business Systems Manager database.\r\nIf required, an optional batch discovery process is provided for IMS and DB2.</p>"]},
{"title": "Discovering Distributed Resources", "description": ["<p>Tivoli<sup>(R)</sup> Business Systems Manager has two methods for discovering distributed resources:</p>"]},
{"title": "Event processing", "description": ["<p>Tivoli<sup>(R)</sup> Business Systems Manager consolidates events from a wide range of IBM<sup>(R)</sup> and independent system vendor products.\r\nEvent processing involves capturing specific events and routing them to Tivoli Business Systems Manager.\r\nThe events result in updates to the Tivoli Business Systems Manager database, which are then displayed\r\non the Tivoli Business Systems Manager console. Events also can trigger the discovery of resources.</p>"]},
{"title": "Events (Messages and Exceptions)", "description": ["<p>Physical resources represented in Tivoli<sup>(R)</sup> Business Systems Manager can receive two event\r\ntypes:  messages and exceptions. Messages reflect the state of the resource\r\n(for example, active, inactive, or abended). Exceptions usually indicate that\r\na resource is experiencing a temporary condition. Events have an alert state\r\nand a priority. Alert states are critical (red), warning (yellow), and normal\r\n(green). Priority states are critical, high, medium, low, ignore, or unknown.\r\nExceptions are compared against thresholds that determine whether a state\r\nchange occurs. Whenever a state change occurs, as a result of either a message\r\nor of an exception exceeding a threshold,   this state change is in turn compared\r\nagainst thresholds to determine whether the event is reflected in a parent\r\nresource. If so, the event is reflected as a child event against the parent.\r\nAs events  occur within the monitored environment, the console displays an\r\nalert icon next to the icon of the affected resource. For more information\r\non event processing, refer to the <cite>IBM Tivoli Business Systems Manager Administrator's Guide</cite>.</p>", "<p>An example of an exception is unacceptable response time associated\r\nwith a CICS<sup>(R)</sup> transaction. In general, events in the distributed environment that\r\nare sent from the Tivoli Enterprise Console<sup>(R)</sup> server are considered exceptions. An example of a\r\nmessage is the reception of a console message informing you that a batch job\r\nhas ended with errors, causing a state change to occur.</p>", "<p>The Event Viewer displays events (exceptions and messages) that are associated\r\nwith either a resource or all of the resources within a business system. Double-clicking\r\nan event opens a window that contains details for the event.</p>", "<p>Because an event is associated with a resource and that resource can appear\r\nin multiple business systems, the Event Viewer filters out the duplicates\r\nand displays only unique events.</p>", "<p>The Event Viewer displays only the last message for a resource. To see\r\nall of the messages for a resource: </p>", "<p class=\"indatacontent\">The last message is the only one that is relevant and the only one you\r\ncan take action against. When there are multiple exceptions, all are relevant.\r\nNew resources added to a business system are not displayed in the event viewer\r\nuntil the UpdateObjectPathCache job runs, by default every 15 minutes.</p>", "<p>Propagation is the process that allows events to escalate or propagate\r\na status up the business system view. Exceptions, console messages, and other\r\nevents are assigned priorities for each resource. When a resource receives\r\nan event, the priority of the event is examined and compared against tolerance\r\nrates set for that resource. If a threshold is exceeded, an alert occurs on\r\nthat resource and sends an event (called a child event) to its parent resource\r\non the hierarchy.  This, in turn, can cause another event to occur and another\r\nalert to be  sent further up the hierarchy.  These thresholds are configured\r\nin one of  the following ways:</p>", "<p class=\"indatacontent\">Propagation always flows upward.</p>", "<p>Propagation can be customized by:</p>", "<p>You can test your propagation customization by generating test messages\r\nand exceptions and examining their effect. For more information on propagation\r\ncustomization, refer to the <cite>IBM Tivoli Business Systems Manager Administrator's Guide</cite>.</p>"]},
{"title": "Managing Alerts", "description": ["<p>A fundamental principle of an effective centralized command center is to\r\nmake alerts meaningful. The colors that indicate problems of greater or lesser\r\nseverity must reflect the context in which they appear. Tivoli<sup>(R)</sup> Business Systems Manager introduces\r\ntwo concepts in managing this problem: correlated priorities and alert ownership.</p>", "<p>Correlated priorities is the process of setting the priorities of a resource's\r\nchild events while considering the parent resource's thresholds such that\r\nthe child events accurately affect the alert state of the parent resource.\r\nTaking ownership of an event can change the tagged resource icon from <span class=\"italic\">alert</span> to <span class=\"italic\">ownership</span> status, depending\r\non the preferences set by  an administrator.  Taking ownership also acts as\r\na contract of problem acceptance. The user name is automatically recorded\r\nin a note, which allows narrative action information to be recorded, viewed,\r\nand played back for reviews. Because all clients are updated instantly when\r\nownership is taken, other members of the command center team and department\r\nusers with special business system views can see that someone is responding\r\nto an alert. Integration with the Tivoli Framework products enable the state\r\nchanges in products such as Tivoli Enterprise Console<sup>(R)</sup> to reflect a consistent view of the enterprise.</p>", "<p>Filtering is a powerful feature for building a business system\r\nview by providing selection criteria, such as resource type, name, and alert\r\nstate. By using filters, the command center staff can quickly create a custom\r\nview to closely monitor a collection of resources showing recent trouble conditions.\r\nFiltering also allows representations of the same resource contained in different\r\nbusiness system views to filter events differently. Operators can be notified\r\nonly of events that they are monitoring.</p>", "<p>Tivoli Business Systems Manager monitors resources for state changes and the performance\r\ncharacteristics that reflect their availability. These resources are represented\r\nby Tivoli Business Systems Manager resources in the database. Actions on a resource, such as an alert\r\nnotification and the propagation of that alert up a view, result from events.\r\nEvents can be exceptions associated with a resource or a state change of that\r\nresource. In a z/OS<sup>(R)</sup> environment, exceptions occur when the counters that\r\nmeasure performance thresholds are exceeded. An example of an exception is\r\nan unacceptable response time associated with a CICS<sup>(R)</sup> transaction. Another example of an event\r\nis the receipt of a console message that a batch job ended with errors. This\r\ncauses a state change to occur and results in an event. As events occur within\r\nthe monitored environment, they are collected and recorded by Tivoli Business Systems Manager, and\r\nare displayed by tagging an alert icon on the appropriate icon of the resource.</p>", "<p>Propagation is the component that enables Tivoli Business Systems Manager to progress from a physical\r\nto a logical model. As events are propagated to the physical parents of a\r\nresource, they also are propagated to all business system views containing\r\nthose resources.</p>"]},
{"title": "Consoles", "description": ["<p>Tivoli<sup>(R)</sup> Business Systems Manager provides the Tivoli Business Systems Manager console and the Web console that can be used\r\nto view and manage resources. It also provides the executive dashboard that can be configured\r\nto show the executives in your organization a view of predefined services.\r\nThese interfaces are described in more detail in the following sections:</p>"]},
{"title": "Tivoli Business Systems Manager Console", "description": ["<p>The Tivoli<sup>(R)</sup> Business Systems Manager console displays views that reflect state changes\r\nand exceptions that in turn reflect the availability of the resources and\r\nbusiness systems shown. If the availability of a resource or resources is\r\nthreatened, an alert icon is displayed next to the resource or subsystem.\r\nNotification of alerts and events management are primary tasks of the console.\r\nBy observing views, users can see whether the system, subsystem, or resource\r\nis available and performing correctly.</p>", "<p><a id=\"idx127\" name=\"idx127\"></a>The console is a role-based\r\nuser interface and your role determines what you can access. These are the\r\ndefined roles: <a id=\"idx128\" name=\"idx128\"></a><a id=\"idx129\" name=\"idx129\"></a><a id=\"idx130\" name=\"idx130\"></a><a id=\"idx131\" name=\"idx131\"></a><a id=\"idx132\" name=\"idx132\"></a><a id=\"idx133\" name=\"idx133\"></a><a id=\"idx134\" name=\"idx134\"></a><a id=\"idx135\" name=\"idx135\"></a></p>", "<p class=\"indatacontent\">All authorization checking within the console is performed based on these\r\nroles. For more information on the console role definitions, refer to the <cite>IBM Tivoli Business Systems Manager Administrator's Guide</cite>.</p>", "<p>For more information on the console, refer to <cite>IBM Tivoli Business Systems Manager Introducing the Consoles</cite>.</p>"]},
{"title": "Web Console", "description": ["<p>Operators can use the Web console to perform monitoring and problem determination\r\ntasks that they can perform with the regular console. In addition, administrators\r\ncan perform tasks such as creating shared filters.</p>", "<p>To use the Web console, you need an appropriate Web browser.\r\nThe Web console differs in appearance and behavior from the Tivoli<sup>(R)</sup> Business Systems Manager console.</p>", "<p>For more information on the Web console, refer to <cite>IBM Tivoli Business Systems Manager Introducing the Consoles</cite>.</p>"]},
{"title": "Executive Dashboard", "description": ["<p>The executive dashboard can be configured by a system administrator to show\r\nhigh level views of the services within a business, without providing all\r\nof the details about individual business system resources and their states.\r\nThe executive dashboard can also be used to view impact information from the Tivoli<sup>(R)</sup> Service Level Advisor product,\r\nsuch as violations and trends.</p>", "<p>The executive dashboard can also be configured to show the network operations\r\ncenter manager or IT manager the view that the executive sees but with the\r\nadded ability to locate more detailed information about a network. When an\r\nexecutive calls to check a service that is in a red state, the manager can\r\nsee the view the executive sees and find more information about the business\r\nsystems and resources involved.</p>", "<p>For more information on the executive dashboard, refer to <cite>IBM Tivoli Business Systems Manager Introducing the Consoles</cite>.</p>"]},
{"title": "Views", "description": ["<p>The Tivoli<sup>(R)</sup> Business Systems Manager console and the Tivoli Business Systems Manager Web console display the resources in\r\nyour enterprise in various views. When notifications that trigger alerts are\r\nreceived from the various collection agents within the enterprise, the alerts\r\nare displayed as graphic overlays on the resources, indicating the different\r\nstatus of your resources.</p>", "<p>Using Tivoli Business Systems Manager, you can manage resources in a way that best reflects\r\nyour current organization. Your Tivoli Business Systems Manager implementation can reflect either a\r\ndecentralized or a centralized control structure. The resources can either\r\nbe defined to Tivoli Business Systems Manager or be discovered using various methods to detect the\r\nconfiguration of the resources. After the resources are defined or discovered,\r\nthey are registered in the Tivoli Business Systems Manager database; that is, information about the\r\nresources is stored in the database and is available for monitoring and viewing.</p>", "<p>The <span>All Resources view</span>, available for administrators\r\nonly, displays all the physical resources registered in the Tivoli Business Systems Manager database.\r\nBusiness system views can be created from the console or automatically from\r\nincoming discovery and event data. A business system view is a logical view\r\nthat includes any subset of the registered resources that are of interest\r\nfor monitoring. Each resource is represented within the view. You can create,\r\nsave, and later access business system views. By opening several windows,\r\neach containing a different business system view, you can monitor different\r\nresources and their various relationships from a single workstation. Business\r\nsystem views can be based on an actual business system, an application or\r\nset of applications, a department, a vertical area of responsibility, or a\r\ngeographical region.</p>", "<p>The following are examples of business system views:</p>", "<p>You can use business system views to logically organize the resources that\r\nyou want to monitor. For example, to monitor a health claim processing system\r\nof a company, you might construct a business system view:<a id=\"idx143\" name=\"idx143\"></a></p>", "<p>The following views are available:  </p>", "<p>Property sheets for each of the resources enable viewing and updating of: </p>", "<p>One or more views are available on the console. The collection\r\nof views is called a workspace. The workspace, along with its views and their\r\nposition, can be saved for later retrieval by this or other operators. Operators\r\ncan have access to multiple workspaces. Workspaces are only available on the Tivoli Business Systems Manager console.</p>"]},
{"title": "Reporting System", "description": ["<p>Tivoli<sup>(R)</sup> Business Systems Manager provides a reporting system for generating reports from real time\r\nand historical availability data that Tivoli Business Systems Manager collects from the resources in\r\nyour enterprise. The reporting system provides report forms for viewing the\r\ndata you need to analyze problems and to anticipate and avoid future problems.\r\nYou can also use the generated reports for trend analysis  and capacity planning.\r\nFor more information on the reporting system, refer to <cite>IBM Tivoli Business Systems Manager Introducing the Consoles</cite>.</p>"]},
{"title": "Problem and Change Support", "description": ["<p><a id=\"idx159\" name=\"idx159\"></a><a id=\"idx160\" name=\"idx160\"></a>IT departments commonly use a problem information system\r\nto document and track issues that pertain to the resources they manage. Typically\r\nthe database record used to manage these issues is called a <span class=\"italic\">problem ticket</span>. The standard workflow of a problem is to create a problem\r\nticket and assign it to a person for resolution. The ticket is closed when\r\nthe problem is resolved. Tivoli<sup>(R)</sup> Business Systems Manager provides an automated process to create problem\r\ntickets when key events occur by defining event-filtering rules.</p>", "<p>You can write request processors for problem requests, change\r\nrequests, and automatic ticketing requests to integrate your problem and change\r\nmanagement application with Tivoli Business Systems Manager.  Your problem and change management application\r\nmust provide an application program interface that supports the functions\r\nrequired by Tivoli Business Systems Manager. For more information on writing request processors, refer\r\nto the <cite>IBM Tivoli Business Systems Manager Problem and Change Management Integration Guide</cite>.</p>", "<p>If you are upgrading from a previous version of Tivoli Business Systems Manager, review\r\nthe information on new features. Some changes might require you to modify\r\nyour request processor that is called from within Tivoli Business Systems Manager and integrated with\r\nyour Problem or Change product.</p>"]},
{"title": "IBM Service Level Management", "description": ["<p>Tivoli<sup>(R)</sup> Business Systems Manager provides a Warehouse Pack that you can use to send information about\r\nresources and alert state changes to the Tivoli Data Warehouse central data\r\nwarehouse. This information can then be accessed by the IBM<sup>(R)</sup> Tivoli Service Level Advisor product\r\nto develop and monitor service level agreements. You can also use the executive\r\ndashboard to view impact information such as violations and trends in Tivoli Service Level Advisor.</p>", "<p>For configuration information about the Warehouse Pack, refer to <cite>IBM Tivoli Business Systems Manager Guide for Warehouse Pack, Version 3.1.0.0, using Tivoli Data Warehouse, Version 1.2</cite>.</p>"]},
{"title": null, "description": ["<p> This chapter describes the Tivoli<sup>(R)</sup> Business Systems Manager components:</p>", "<p>For information on hardware and software requirements for Tivoli Business Systems Manager, refer\r\nto the <cite>IBM Tivoli Business Systems Manager Installation and Configuration Guide</cite>.</p>"]},
{"title": "Base Services", "description": ["<p>Tivoli<sup>(R)</sup> Business Systems Manager services process management data that is collected from\r\nvarious sources.  The data is placed in the Tivoli Business Systems Manager database, where it is examined\r\nto determine its effect on the state of monitored resources and their associated\r\nbusiness systems.  As alerts are generated, they are displayed by the Tivoli Business Systems Manager console,\r\nwhich also accepts user requests for additional information to be displayed.</p>", "<p></p>", "<p class=\"indatacontent\">The Tivoli Business Systems Manager management server includes some of these services:</p>", "<p>Availability information is placed in the Tivoli Business Systems Manager database, where\r\nit is examined to determine its effect on the state of monitored resources.\r\nAs alerts are generated, they are displayed by the Tivoli Business Systems Manager console.</p>", "<p>The Tivoli Business Systems Manager reporting system, a reporting application available\r\nthrough the console or through a Web browser, enables the generation of reports\r\nfrom real-time and historical availability data.</p>", "<p><a href=\"bsms46.htm#serser\">Table 1</a> lists the servers and services that run\r\non them. For descriptions of the services, refer to the <cite>IBM Tivoli Business Systems Manager Installation and Configuration Guide</cite>.</p>", "<p>For a small enterprise environment, you can combine the services\r\non two servers:</p>", "<p class=\"indatacontent\">For limitations and other information on a two server configuration,\r\nrefer to the <cite>IBM Tivoli Business Systems Manager Installation and Configuration Guide</cite>.</p>"]},
{"title": "Components for Handling z/OS Data", "description": ["<p>The Tivoli<sup>(R)</sup> Business Systems Manager source/390 components enable monitoring and management of z/OS-based\r\nsystems: <a id=\"idx191\" name=\"idx191\"></a><a id=\"idx192\" name=\"idx192\"></a><a id=\"idx193\" name=\"idx193\"></a><a id=\"idx194\" name=\"idx194\"></a></p>", "<p></p>", "<p class=\"indatacontent\">In <a href=\"bsms47.htm#s390\">Figure 4</a>, DB2<sup>(R)</sup> indicates DB2 Universal Database<sup>(TM)</sup> for z/OS and OS/390 and DB2 Performance\r\nMonitor/Performance Expert, MAINVIEW indicates MAINVIEW for CICS, DB2, IMS<sup>(TM)</sup> and OS/390, and TMON\r\nindicates ASG-TMON for CICS, DB2 and MVS.</p>", "<p>Information is made available to the object pump in the following\r\nways:</p>", "<p>The task server interacts with the Tivoli NetView for OS/390 and z/OS environments.\r\nCommand requests from an operator are routed to the task server, which routes\r\nthe requests to the appropriate environment. Responses are returned to the\r\ntask server where they are correlated with the request and routed back to\r\nthe requesting operator.</p>"]},
{"title": "Components for Handling Distributed Data", "description": ["<p>Distributed components, which are installed in a Tivoli<sup>(R)</sup> management\r\nregion, are shown in <a href=\"bsms48.htm#fig2\">Figure 5</a>:</p>", "<p>Event enablement, which is installed on the Tivoli Enterprise Console<sup>(R)</sup> server, integrates\r\nwith the Tivoli Management Framework and the Tivoli Enterprise Console program to enable availability and performance\r\nmanagement of distributed resources. Any resource whose status can be communicated\r\nusing a Tivoli Enterprise Console event can be integrated with Tivoli Business Systems Manager.</p>", "<p>The following list includes sources of data for distributed resources:</p>", "<p>The task server interacts with the Tivoli Management Framework environment. Command\r\nrequests from an operator are routed to the task server, which routes the\r\nrequests to the appropriate environment. Responses are returned to the task\r\nserver where they are correlated with the request and routed back\r\nto the requesting operator.</p>", "<p>The agents for Common Listener allow products to send discovery\r\nand event information directly to Tivoli Business Systems Manager without going through Tivoli Enterprise Console server. Depending on the sending adapter, resource discovery information\r\ncan be sent through the common listener service, and the events routed through Tivoli Enterprise Console for correlation. Products that\r\nsupport the Common Listener interface include Tivoli NetView, IBM Tivoli Monitoring,\r\nBMC PATROL, NetIQ AppManager Server, HP OpenView, Network Node Manager, and\r\nComputer Associates Unicenter TNG.</p>", "<p>The Tivoli Business Systems Manager servers collect event data from distributed data sources:</p>", "<p>The Tivoli Enterprise Console server handles events from distributed resources:</p>"]},
{"title": null, "description": ["<p>Tivoli<sup>(R)</sup> Business Systems Manager collects data from monitors in the z/OS<sup>(R)</sup> environment\r\nas well as from monitors in the distributed environment.</p>"]},
{"title": "z/OS Data Source Software Requirements", "description": ["<p>These are the software and release versions of the z/OS<sup>(R)</sup> data sources\r\nsupported by Tivoli<sup>(R)</sup> Business Systems Manager.</p>"]},
{"title": "Distributed Data Sources Software Requirements", "description": ["<p>These are the software and release versions of the distributed data sources\r\nsupported by Tivoli<sup>(R)</sup> Business Systems Manager. </p>"]},
{"title": null, "description": ["<p>When designing your implementation of Tivoli<sup>(R)</sup> Business Systems Manager, consider the following topics:</p>"]},
{"title": "Environment", "description": ["<p>Before getting started on a Tivoli<sup>(R)</sup> Business Systems Manager implementation, evaluate the existing\r\nenvironment. Collect information about the existing host environment:</p>", "<p class=\"indatacontent\">Also, collect information\r\nfor the distributed environment:</p>", "<p>This information helps you determine what systems can be managed and what\r\nevents are sent to Tivoli Business Systems Manager. It is important to understand how the events are\r\nused and where they are generated.</p>", "<p>Also consider the Tivoli Business Systems Manager server environment:</p>"]},
{"title": "Users", "description": ["<p>Identify the Tivoli<sup>(R)</sup> Business Systems Manager users. There might be multiple types of users. If so,\r\nassign priorities.  For example, identify the administrators responsible for\r\nmaintaining the system. Some administrators are responsible for building the\r\nbusiness views.  Operations can use the Tivoli Business Systems Manager as their interface to the environment.\r\nAdditionally, second level or specialist teams can also use the Tivoli Business Systems Manager as\r\ntheir starting point for investigating problems.  Understanding the users\r\nis critical to understanding what event data must be sent to the Tivoli Business Systems Manager and\r\nhow it should be displayed.</p>", "<p>Once the users are identified, identify their workflow.  Consider asking\r\nthe following questions:</p>", "<p class=\"indatacontent\">Write user scenarios to use during testing of your implementation.</p>"]},
{"title": "Event Sources", "description": ["<p>List your event sources as well as any event sources that you are not including\r\nin your implementation. Include the resource types and the mapping to events.</p>", "<p>For the z/OS<sup>(R)</sup> environment, define both the method for <span class=\"italic\">discovery</span> as well as the method for receiving events.  Multiple data sources for\r\ndiscovery can help ensure a complete environment. However, multiple event\r\nsources can also lead to confusion. You can have multiple events for the same\r\nproblem.  It is critical to set the event source and the priority for each\r\nevent appropriately.  For example, for started tasks, information can be received\r\nusing the object pump interface to the extended console, as well as from System Automation for OS/390<sup>(R)</sup>.\r\n In this case, automation most likely generates the most critical information.\r\nBecause of this, set the automation events to a priority higher than the base\r\nconsole messages for starting and stopping.   For the z/OS environment,\r\nthe resource types and hierarchy are predefined within Tivoli<sup>(R)</sup> Business Systems Manager.</p>", "<p>For the distributed environment, include the full detail of the distributed\r\nresource types and the mapping to events. When using the Tivoli Enterprise Console<sup>(R)</sup>, the recommended\r\napproach for sending events related to distributed resources is to only send\r\nthem as exceptions. For any exceptions that you generate, also generate clearing\r\nevents, or have a manual process in place for taking ownership of the events\r\nand clearing them once the problem has been resolved.  Note that in order\r\nfor the taking ownership of an event to clear the event, an administrator\r\nmust have set this behavior in the ownership preferences. For more information\r\non setting this preference, refer to the <cite>IBM Tivoli Business Systems Manager Administrator's Guide</cite>.</p>", "<p>You can also configure Tivoli Business Systems Manager to stay in sync with the Tivoli Enterprise Console server,\r\nso that when an event is closed on the Tivoli Enterprise Console server it is also closed in Tivoli Business Systems Manager.\r\nThe reverse synchronization is also possible. This synchronization includes\r\nthe situation where an event is manually closed on either the Tivoli Enterprise Console console\r\nor the Tivoli Business Systems Manager console.</p>", "<p>Events for distributed resource types can be sent to Tivoli Business Systems Manager using either\r\nthe Tivoli Business Systems Manager Common Listener service or the Tivoli Business Systems Manager Event Enablement service. <a href=\"bsms55.htm#clvstec\">Figure 6</a> shows the overall structure for distributed event sources.</p>", "<p>Any event received by the Tivoli Enterprise Console server can be forwarded to Tivoli Business Systems Manager using\r\nthe event enablement service installed on the Tivoli Enterprise Console server. Tivoli Business Systems Manager supplies\r\nsample Tivoli Enterprise Console rules and a sample script for forwarding events from the following\r\nsources:</p>", "<p>The following products include support for forwarding events to Tivoli Business Systems Manager using\r\nthe common listener service:</p>", "<p>In the case of event sources for which both the event enablement and common\r\nlistener services can be used, the recommended approach is to use the event\r\nenablement service because this approach provides greater flexibility for\r\nfiltering and processing events using the Tivoli Enterprise Console server. For usage examples,\r\nrefer to the <cite>IBM Tivoli Business Systems Manager Administrator's Guide</cite>.</p>"]},
{"title": "Resources", "description": ["<p>When resources are added to the Tivoli<sup>(R)</sup> Business Systems Manager database, they first appear in the\r\nAll Resources view. This is where all physical resources are represented.\r\nThe All Resources view contains the entire inventory known to the Tivoli Business Systems Manager.</p>", "<p>When considering the classes of resources to monitor with the Tivoli Business Systems Manager, plan\r\nhow these resources affect the state of your business systems. Start with\r\nhigh level objects, and when you determine they are required, add additional\r\nlow level objects. For example, you might monitor DB2<sup>(R)</sup> subsystems down to the database level.\r\nWhen you find that this is not sufficient, you can enable monitoring at lower\r\nlevels.</p>", "<p>The resources shown in the All Resources view can be split into two groups: </p>", "<p>The configuration-level resources for the z/OS<sup>(R)</sup> system can be divided into the following\r\ngroups:</p>", "<p class=\"indatacontent\">The configuration-level resources for the z/OS system are defined manually using the Tivoli Business Systems Manager console.</p>", "<p>The configuration-level resources for distributed systems can be divided\r\ninto the following groups:</p>", "<p>For distributed resources, there are two approaches to physical placement:</p>"]},
{"title": "Resource Types", "description": ["<p>Resource types represent classes of manageable components at a business\r\nimpact level. An example of a resource type includes a machine or an application,\r\nwith one or more event sources mapping to that resource type. Each resource\r\ntype can have: </p>", "<p class=\"indatacontent\">Other examples of resource types include Node, WindowsServer, OracleDatabase,\r\nCustomApp, Hub, NetworkDevice, and so on.</p>", "<p>A resource type can have multiple instances. For example, if there is a\r\nresource type of WindowsServer and there are three Windows<sup>(R)</sup> servers\r\n(ServerA, ServerB, and ServerC), you have three instances of WindowsServer\r\n(for example, one for ServerA, one for ServerB, and one for ServerC).  Events\r\nfor each server are displayed on the Properties Page of the appropriate server.</p>", "<p>Resource types can be defined with as much granularity as needed. As a\r\nguideline, limit your granularity to actual resources for which a state can\r\nbe represented. Too much granularity for resource types impacts system performance\r\nand usability.</p>", "<p>Consider the following items when defining resource types:</p>"]},
{"title": "Distributed Generic Object Types", "description": ["<p>Generic object types can be used for all distributed resources\r\nand can be defined for any kind of event.  In order for an instance of a generic\r\nobject type to be displayed on a Tivoli<sup>(R)</sup> Business Systems Manager console, a generic event must be forwarded\r\nto the Tivoli Business Systems Manager for the given instance. To ensure that an event is generated\r\nand the icon is displayed on the console, a discovery event can be set to\r\ndo the initial creation. To populate Tivoli Business Systems Manager with a complete set of distributed\r\nresources that represent your enterprise, you can write a script to send generated\r\ndiscovery events to Tivoli Business Systems Manager</p>", "<p>The following list contains examples of generic object types:</p>", "<p>The following list contains examples of events that should not represent\r\nseparate object types:</p>", "<p>When you add a generic object type to the Tivoli Business Systems Manager product, also make the\r\nfollowing updates:</p>"]},
{"title": "z/OS-Related Generic Object Type", "description": ["<p>There is also a generic object type that can be used to represent any resource\r\nfor which an object type does not already exist in the z/OS<sup>(R)</sup> hierarchy.\r\nThis generic object class is displayed as a child of the operating system\r\nclass. Its status is set using the external data interface (EDI) when called\r\nby automation.</p>", "<p>Before you can use this generic object type, define any messages, exceptions,\r\nand states that are related to the object type.</p>", "<p>After doing this, you can update your automation routines to send messages\r\nand exceptions affecting the resource represented by the generic object.</p>"]},
{"title": "Resource Discovery", "description": ["<p>Resource discovery for the All Resources view can be performed using initial\r\ndiscovery methods or by using active discovery methods.  You can use initial\r\ndiscovery methods to list resources that exist in the current environment.</p>", "<p>You should limit your discovery to resources that you can relate to business\r\nsystems. Discovering unnecessary resources impacts system performance.</p>", "<p>Many of the z/OS<sup>(R)</sup>-defined feeds have initial discovery methods\r\nthat require running specified jobs on the z/OS system.  In some cases these can be run\r\nbefore Source/390 started tasks are configured on the systems.  This allows\r\nfor early discovery of resources, and supports the building of the business\r\nsystems earlier in the process.</p>", "<p>For more information on the discovery process for z/OS-based\r\nresources, refer to the <cite>IBM Tivoli<sup>(R)</sup> Business Systems Manager Administrator's Guide</cite>.</p>", "<p>For distributed resources, tables or resource placement rules are customized\r\nto specify where new resources are placed relative to the configuration-level\r\nresources. You can run scripts to generate the initial instance of resources,\r\nwhen the resources can be predetermined.</p>", "<p>To discover distributed resources consider these steps: </p>"]},
{"title": "Adding Resources", "description": ["<p>You can add new z/OS-related resources to the Tivoli<sup>(R)</sup> Business Systems Manager by using Insert on\r\nthe context menu of any resource in the All Resources view.  The Insert menu\r\nhas a submenu that lists all of the resources that you can create at this\r\nlevel, based on the resource hierarchy. It is recommended that you do not\r\nuse manual resource creation for resources that are automatically created\r\nby either discovery or by events.</p>", "<p>Rediscovery is another method that you can use to find new  z/OS-related\r\nresources. After initial discovery is complete, use rediscovery to register\r\nnew resources. For more information, refer to <a href=\"bsms70.htm#appa\">Discovery and Resource Monitoring</a>.</p>", "<p>Distributed resources can be added using bulk discovery thorough\r\none of the Common Listener adapters, or as a result of the receipt of the\r\nfirst event for a resource.  This first event can be an actual event or one\r\ngenerated using a script or command.</p>"]},
{"title": "Business Systems", "description": ["<p>There are two common types of business systems:</p>", "<p class=\"indatacontent\">Both types of business systems are important in a business systems management\r\nsolution. Other types of business systems can also be built, such as ones\r\nbased on geography or company organization. Business systems can be built\r\nusing any of the available business system definition tools, including drag\r\nand drop, Automated Business Systems, or XML toolkit definition.</p>", "<p>When dealing with failover or hot-standby servers used for redundancy,\r\ninclude them all in the appropriate business system. Their propagation should\r\nbe adjusted such that these resources do not affect business system status\r\nuntil they are moved to primary status.  For example, a Tivoli Enterprise Console<sup>(R)</sup> event indicating\r\na failover or high availability switch has just been completed could be used\r\nto submit an XML update of propagation values.</p>", "<p>Depending upon the situation, each of the methods for creating business\r\nsystems have a role:</p>", "<p>As you design your business systems, keep the level of nesting\r\nof business systems to the minimum necessary to reflect your business processes.\r\nAs the level of nesting of business systems increases, system load due to\r\nevent processing and propagation also increase, thereby decreasing total event\r\nthroughput in the system.</p>"]},
{"title": "Business System Based on Resource Class", "description": ["<p>Business systems based on resource classes are sometimes referred to as\r\nvertical business systems, silo-based business systems, or tower-based business\r\nsystems.  When you build these business systems, ensure that all resources\r\ncreated in the All Resources view are automatically added to a business system.\r\nThis ensures that resources are not omitted.</p>", "<p>Consider updating your change control procedures to include adding or modifying\r\nresources:</p>", "<p>These class-based business systems are also defined based on the current\r\noperations center methodology.  For  example, if an operations team is responsible\r\nfor monitoring all network resources, create a network business system to\r\ncontain all the network resources.</p>", "<p><a href=\"bsms63.htm#bsclass\">Figure 7</a> shows an example of a class-based business system.</p>"]},
{"title": "Business System Based on Application or Business Process", "description": ["<p>Business systems based on application or business processes are the more\r\ndifficult types of business systems to design, but are more critical in providing\r\na true business value.  Understanding the components of the application and\r\nbusiness system requires an understanding of each of the applications or business\r\nsystems.</p>", "<p>For example, you can build a business system based on consumer banking,\r\npurchasing, help desk, or order entry.  It is important to understand the\r\ncomponents of these business systems:</p>", "<p>In order to build the components of an application-based business system,\r\nyou have to identify its components.  If naming standards are available, they\r\ncan be used to relate the components to a business system. If naming standards\r\nare not available, identify the components by working with the application\r\nowner.  If your organization has a database that includes resource definitions\r\nand where those resources are used, you can use this information to create\r\nXML definitions that define business systems.  When building these application-based\r\nbusiness systems, understanding the components is the first step. Understanding\r\nthe dependency relationship and priority of these components with one another\r\nwithin the application is also important.  For example, if an application\r\ndepends on a set of Web applications, are these used for separate functions,\r\nor are they used as a pool for supporting the application load?  Does each\r\nserver provide the same function, or are some of the servers providing more\r\nprocessing than others?  Answers to these questions help determine the propagation\r\nrules that are specified when defining the business system.</p>", "<p><a href=\"bsms64.htm#bsprocess\">Figure 8</a> shows an example of a business process-based business\r\nsystem.</p>"]},
{"title": "Collecting Information", "description": ["<p>As you design business systems, think about how they are used and by whom.\r\nIdentifying the resources that comprise a business system is a manual process.\r\nConsider the following steps to collect information for your design:</p>", "<p>When you are identifying resources, answer the following questions:</p>", "<p>When you understand the type of business system to create, the next step\r\nis to determine what should be included in the business system.  If you are\r\nusing a tower approach to build a business system (for example, a business\r\nsystem of all UNIX<sup>(R)</sup> servers), you can populate the business system with all resources\r\nof the same type that represents UNIX servers.</p>", "<p>If you are using a business focus to build your business system, consider\r\nthe following questions:</p>", "<p class=\"indatacontent\">Understanding how the business system is used, and how people are to\r\nreact to its status is critical to understanding what should be in each business\r\nsystem.</p>", "<p>An example business system might contain:</p>", "<p>After you define a business system, it is important to also define the\r\nchange processes to ensure proper updates of the business systems after they\r\nare built.</p>"]},
{"title": "Resource Hierarchy", "description": ["<p>The following are some items to consider while you are designing your business\r\nsystem:</p>"]},
{"title": "Leaf Node Behavior", "description": ["<p>The event viewer implements special behavior for resources containing physical\r\nchildren (leaf nodes). When business systems contain the parent nodes of these\r\nleaf nodes, but do not include the leaf nodes, these views take into account\r\nthe state of the leaf nodes. For example, a resource view has the following\r\nconfiguration:</p>", "<p class=\"indatacontent\">You can build a business system as follows:</p>", "<p class=\"indatacontent\">If you launch the event viewer from BSYS_123, all the events from batch\r\njobs 1-6 are displayed.</p>", "<p>You can negate this leaf processing by placing the children in the business\r\nsystem underneath their parent. Consider the following business system:</p>", "<p class=\"indatacontent\">The event viewer only displays events for Batch Job 1 and Batch Job 6,\r\nnot Batch Jobs 2-5. This concept works for all resource types that\r\nhave physical children within the resource view.</p>", "<p>Consider the following behavior of child resources:</p>"]},
{"title": "Business Systems Library", "description": ["<p>When a group of resources is used by multiple business processes, build\r\nit within a reusable business system folder.  A reusable business system folder\r\nis a special case of a standard business system folder, created in the business\r\nsystem tree with a specific name to indicate that it contains applications\r\nor parts of business processes that are to be reused within other business\r\nsystems.  These business system folders are built at the lowest level required\r\nfor propagation considerations.  For example, if there is a Web server pool\r\nused by multiple applications, create it by itself as a pool within the reusable\r\nbusiness system folder. It can then be used in any other business system,\r\nwith its own propagation settings, as required.  Where possible, build reusable\r\nbusiness systems using automated processes including the Automated Business Systems function or\r\nXML, depending upon the environment.</p>", "<p>The resources within a business system can be displayed in a business system\r\ntopology view, with lines connecting the resources.  This view shows the dependency\r\nrelationship between the resources in the business system.  If the resources\r\nalways have the same relationship regardless of which business system in which\r\nthey are included, generic links should be built against the physical resources.\r\n These are displayed when business system topology is displayed for these\r\nresources.  If the dependency relationship of the resources is different depending\r\non the business system, then the generic links should be defined within the\r\nbusiness system resource or business system.  These generic links are shown\r\nas lines between the resources as they are displayed in the business system\r\ntopology view.</p>", "<p>When a reusable business system is to be included in another\r\nbusiness system folder, it is linked using a business system shortcut. A business\r\nsystem shortcut includes many of the properties of the reusable business system\r\nto which it is linked:</p>", "<p>Resource level thresholds are established by using the class\r\nlevel thresholds of the contained resources, overridden by any specific thresholds\r\nspecified in the reusable business system to which the business system shortcut\r\nis linked.</p>", "<p>Some of the properties of the reusable business system are not included\r\nin the business system shortcut:</p>", "<p class=\"indatacontent\">For more information on creating and using business system shortcuts,\r\nrefer to the <cite>IBM Tivoli<sup>(R)</sup> Business Systems Manager Administrator's Guide</cite>.</p>", "<p>There are multiple ways to include the reusable business systems in the\r\nappropriate business-based business system.  When using the Automated Business Systems function,\r\nthe class used is LOB, and a clear relationship of paths must be used to define\r\nthe reusable business system occurrence to be include in the appropriate business\r\nsystem.  The same is true when using XML, that is, the appropriate LOBL link\r\nmust be provided to link the new business system shortcut defined in the business\r\nsystem to the reusable business system.</p>", "<p>There is an additional consideration to keep in mind when defining reusable\r\nbusiness systems.  The weights are defined on the children within the business\r\nsystem.  Therefore all children have the same weight when dealing with the\r\nsource or any of the business system shortcuts.</p>"]},
{"title": "Automated Business Systems", "description": ["<p>The Automated Business System process is driven by a configuration\r\nfile. This configuration file consists of patterns, matching criteria, resulting\r\npaths (business systems), and function calls.</p>", "<p><a href=\"bsms69.htm#absover\">Figure 9</a> shows an overview of the primary components of the Automated Business Systems configuration\r\nfile. When a resource is created or modified, the system compares attributes\r\nof the resource against one or more patterns that make up a criteria. If the\r\ncriteria are met, a representation of the resource is created in one or more\r\nbusiness systems represented by a path related to the matching criteria.</p>", "<p>The <span class=\"bold\">absTest.ksh</span> script can be used to test a loaded\r\nconfiguration file to determine which resources, if any, match criteria in\r\nthe configuration file. If too many resources match the criteria, you can\r\nmake the criteria more explicit. Conversely, if too few resources match the\r\ncriteria, you can make the criteria less explicit. Once you are satisfied\r\nthat the criteria matches the appropriate number of resources, you can either\r\ncreate the target business systems or wait for an appropriate resource to\r\nbe created or modified which in turn causes the business system to be created\r\nor modified. In a running system, this is all automatic. There are two SQL\r\nserver jobs that periodically process the pattern matching and business system\r\ncreation tasks.</p>", "<p>After you load a configuration file, the process for modifying it consists\r\nof the following steps:</p>", "<p>As you implement automated business systems, consider the following techniques:</p>", "<p class=\"indatacontent\">For additional information on using the Automated Business Systems function and its commands,\r\nrefer to the <cite>IBM Tivoli<sup>(R)</sup> Business Systems Manager Administrator's Guide</cite>.</p>"]},
{"title": null, "description": ["<p>After you decide which resources to monitor, use this chapter\r\nto select the method to use to discover those resources. The resources in\r\nthis chapter are grouped by resource type.</p>"]},
{"title": "Discovery", "description": ["<p>Before Tivoli<sup>(R)</sup> Business Systems Manager can monitor enterprise-wide resources, the resource discovery\r\nprocess must be run. This process can be a manual process of submitting discovery\r\nbatch jobs from the mainframe or an automatic process directly from the graphical\r\nuser interface (GUI).</p>"]},
{"title": "Bulk Discovery", "description": ["<p>This process runs discovery batch jobs on the z/OS<sup>(R)</sup> system. The discovery jobs run utilities\r\nto discover resources that are required to be monitored by Tivoli<sup>(R)</sup> Business Systems Manager. The information\r\nrequired to discover these resources is sent to the Tivoli Business Systems Manager database. Here,\r\nLoad/Discover scheduled jobs are run to discover resources in the Tivoli Business Systems Manager database.</p>", "<p>Distributed resources instrumented through the common listener\r\nprovide bulk discovery, which discovers all the resource instances related\r\nto the instrumented product. This information is sent to the database server\r\nwhere the resource database is updated. The IBM<sup>(R)</sup> Tivoli Monitoring for products, Tivoli NetView,\r\nTNG, PATROL, Application Manager, and Tivoli Workload Scheduler for z/OS provide scripts that scan the\r\nenvironment that they are managing and generate events to create resources\r\nin the database.</p>"]},
{"title": "Auto Discovery", "description": ["<p>When a user enables the auto discovery process, Tivoli<sup>(R)</sup> Business Systems Manager resources are discovered\r\nautomatically. Examples include DB2<sup>(R)</sup>, IMS<sup>(TM)</sup>, and CICSPlex<sup>(R)</sup> resources.</p>", "<p>Distributed resources instrumented through the common listener\r\nprovide delta discovery.  Delta discovery sends changes to the resource instances\r\nrelated to the instrumented product to the database server.  Changes can include\r\nresource attribute changes, resource deletion, and new resource creation.\r\n The IBM<sup>(R)</sup> Tivoli Monitoring PACs provide scripts that monitor the environment for\r\nnew resources and generate events to reflect these changes.</p>"]},
{"title": "Rediscovery", "description": ["<p>The rediscovery process is similar to running the bulk discovery\r\nprocess except that the discovery of resources already in the database are\r\nignored. For distributed data sources, auto discovery and rediscovery are\r\nessentially the same.</p>"]},
{"title": "Discovery by Event", "description": ["<p>This process discovers resources based on events (messages and exceptions)\r\nthat are sent to Tivoli<sup>(R)</sup> Business Systems Manager. If a resource is not discovered during bulk discovery\r\nand an event is trapped for this resource, the resource is discovered and\r\nthe trapped event is posted to the discovered resource.</p>", "<p>Resources can also be discovered as a result of messages and exceptions\r\nissued by monitored products such as CICSPlex<sup>(R)</sup>, DB2<sup>(R)</sup>, IMS<sup>(TM)</sup>, and SMS.</p>", "<p>Within the NetView<sup>(R)</sup> for z/OS<sup>(R)</sup> parameter file (IHS$PRM), there is a\r\nthreshold setting (IHS$DISC_FROM) that causes discovery events to flow to Tivoli Business Systems Manager using\r\nthe bulk processing path.  This threshold protects typical event traffic that\r\nflows through the source/390 object pump from being flooded by discovery events.\r\n By default, this is set to 5000 but can be adjusted lower if discovery event\r\nflooding occurs.</p>"]},
{"title": "Discovery Filtering", "description": ["<p>This process filters resources that should or should not be monitored by Tivoli<sup>(R)</sup> Business Systems Manager.</p>"]},
{"title": "Supported Discovery Functionality by Product", "description": ["<p><a href=\"bsms77.htm#os390sm\">Table 4</a> shows the supported OS/390<sup>(R)</sup> monitors for the discovery process.</p>", "<p><a href=\"bsms77.htm#smcics\">Table 5</a> shows the supported Subsystem monitors for CICS<sup>(R)</sup> for the discovery\r\nprocess.</p>", "<p><a href=\"bsms77.htm#smdb2ims\">Table 6</a> shows the supported Subsystem monitors for DB2<sup>(R)</sup> and IMS<sup>(TM)</sup> for\r\nthe discovery process.</p>", "<p><a href=\"bsms77.htm#jobsch\">Table 7</a> shows the supported Job Schedulers for\r\nthe discovery process.</p>", "<p><a href=\"bsms77.htm#autoprod\">Table 8</a> shows other supported monitors for the discovery\r\nprocess.</p>", "<p><a href=\"bsms77.htm#disssm\">Table 9</a> shows the supported monitors for distributed sources\r\nfor the discovery process.</p>"]},
{"title": "Resource Monitoring", "description": ["<p>This section describes the resources monitored by Tivoli<sup>(R)</sup> Business Systems Manager integration.</p>"]},
{"title": "Base Resources", "description": ["<p>Base resources include the monitoring of resources that are directly under\r\nEnterprise, Complex, Machine, LPAR, or operating system. These can include CICSPlex<sup>(R)</sup>, RODM, SMS, and other resources.</p>"]},
{"title": "Low-level Resources", "description": ["<p>These are resources that are children of base resources. These can be DB2<sup>(R)</sup> buffer\r\npools, CICS<sup>(R)</sup> to CICS connection, CICS to DB2 connection, IMS<sup>(TM)</sup> databases or other resources.</p>"]},
{"title": "Supported Resource Monitoring Functionality by Product", "description": ["<p><a href=\"bsms81.htm#os390sup\">Table 10</a> shows the supported OS/390<sup>(R)</sup> monitors for the resource monitoring\r\nprocess.</p>", "<p><a href=\"bsms81.htm#rssmcics\">Table 11</a> shows the supported Subsystem monitors for CICS<sup>(R)</sup> for the resource monitoring process.</p>", "<p><a href=\"bsms81.htm#rssmims2\">Table 12</a> shows the supported Subsystem monitors\r\nfor IMS<sup>(TM)</sup> for the resource monitoring process.</p>", "<p><a href=\"bsms81.htm#rssmdb2\">Table 13</a> shows the supported Subsystem monitors\r\nfor DB2 for the resource monitoring process.</p>", "<p><a href=\"bsms81.htm#rssmwebs\">Table 14</a> shows the supported Subsystem monitors\r\nfor the WebSphere<sup>(R)</sup> resource monitoring process.</p>", "<p><a href=\"bsms81.htm#rjobsch\">Table 15</a> shows the supported Job Schedulers for the resource\r\nmonitoring process.</p>", "<p><a href=\"bsms81.htm#rautopro\">Table 16</a> shows the supported automation products for the\r\nresource monitoring process.</p>", "<p><a href=\"bsms81.htm#rdisssm\">Table 17</a> shows the supported monitors for distributed sources\r\nfor the resource monitoring process.</p>"]},
{"title": null, "description": ["<p>One approach to implementation is the use of a test or quality assurance\r\nenvironment that parallels the production environment. This test environment\r\nis used for implementing new function as well as new maintenance levels. It\r\nshould be representative of your production environment.</p>", "<p>Consider the following topics:</p>"]},
{"title": "Planning for Implementation", "description": ["<p><a href=\"bsms100.htm#spln\">Appendix. Sample Task List</a> provides a list of tasks to consider for a\r\nproject plan to implement a Tivoli<sup>(R)</sup> Business Systems Manager solution.</p>", "<p>The implementation team consists of individuals responsible for the following\r\nroles:</p>", "<p class=\"indatacontent\">Depending on your environment, an individual might be responsible for\r\nmore than one of these roles.</p>", "<p>One of the most important roles is that of the project manager. The project\r\nmanager works with the rest of the implementation team to produce a project\r\nplan based on the design, and to help obtain commitments from team members\r\ninvolved in implementing the solution. Finally, the project manager tracks\r\nthe progress of the implementation, and works to keep the project on track.\r\nThe implementation team should be involved throughout the implementation process.\r\nThis not only accomplishes the building of skills but also creates an environment\r\nof ownership of the solution.</p>", "<p>As you plan for implementation, keep in mind that Tivoli Business Systems Manager is not a monitoring\r\nproduct, but a receiver of events from existing monitors. These monitors must\r\nbe in place and operating properly before you can integrate them into your Tivoli Business Systems Manager solution.</p>", "<p>As you involve team members from the community that will use the Tivoli Business Systems Manager solution,\r\nunderstand and be in agreement as to how the solution will be used and how\r\nit will fit into their processes, especially the existing change management\r\nprocess.</p>", "<p>As you examine the hardware recommendations, note that these are minimum\r\nrequirements. Use the fastest and largest servers that you can justify, as\r\nthese give the best-performing solution with the longest life. Also choose\r\nservers that can be expanded or extended over time as your solution grows.\r\nThe final step of the planning phase is to order hardware and any prerequisite\r\nsoftware, and to submit any required change requests for the project.</p>", "<p>Consider security when you prepare your test and production environments:</p>"]},
{"title": "Preparing the Test Environment", "description": ["<p>The test environment is the first place that new function or new product\r\ncode is installed. The test environment includes the following components:</p>", "<p class=\"indatacontent\">After implementing the Tivoli Business Systems Manager servers, as well as the Tivoli Enterprise Console and source/390\r\nfeeds, you can connect one or more test consoles and begin to familiarize\r\nyourself with the product.</p>", "<p>As you implement each event source, you should fully understand the workflow\r\nof each event from its source through the Tivoli Business Systems Manager solution. This makes testing\r\nand debugging much easier and efficient. Also, only discover objects that\r\nare necessary to reflect the state of the business to be managed. Discovering\r\nunnecessary objects impacts the performance and usability of the solution.</p>", "<p>Next, implement one or two relatively simple business systems based on\r\nresources in the test environment. Design the business systems as straightforward\r\nas possible while making them representative of a meaningful business process\r\nor technology view.</p>", "<p>When you are satisfied with the functionality in the test environment,\r\nyou are ready to implement the same function in the production environment.</p>"]},
{"title": "Preparing the Production Environment", "description": ["<p>Functions and changes are implemented in the production environment after\r\nhaving been implemented in the test environment. The production environment\r\nincludes the following components:</p>", "<p class=\"indatacontent\">After implementing the Tivoli Business Systems Manager servers, as well as the Tivoli Enterprise Console server and\r\nsource/390 feeds, you can connect your consoles and begin to test their function.</p>", "<p>At this point, begin implementing your business systems. Begin with the\r\nsimpler business systems and progress to the more complex. In this manner,\r\nyou can demonstrate business value as early as possible.</p>", "<p>When you are satisfied with the functionality in the production environment,\r\nyou are ready to implement optional functions in the test environment in preparation\r\nfor implementing them in the production environment.</p>"]},
{"title": "Implementing Optional Functions", "description": ["<p>There are some functions beyond the basic Tivoli<sup>(R)</sup> Business Systems Manager components that are typically\r\nimplemented as follow-on activities. These include:</p>", "<p class=\"indatacontent\">If at all possible, implement these in your test environment first to\r\nfamiliarize yourself with their function and operation. After this, move them\r\nto the production environment.</p>"]},
{"title": "History Server", "description": ["<p>The history server is an SQL server that maintains an event history that\r\nis used by the reporting system. The history server is kept up-to-date by\r\nperiodically synchronizing the resource data with the central database server,\r\nand by copying events from the central database server at an interval that\r\nyou specify, typically every 5 minutes. Older events are then deleted from\r\nthe central database server.</p>", "<p>After installing the prerequisite software on the history server, you can\r\nenable the history server:</p>", "<p class=\"indatacontent\">For more information on installing the history server, refer to the <cite>IBM Tivoli<sup>(R)</sup> Business Systems Manager Installation and Configuration Guide</cite>.</p>"]},
{"title": "Reporting System", "description": ["<p>The Tivoli<sup>(R)</sup> Business Systems Manager provides a Web-based reporting tool to produce operational and\r\nhistorical reports. Before using the reporting system, you must authorize\r\none or more user IDs to access the reports. Authentication is done using LDAP\r\nthrough Websphere or local windows user groups.</p>", "<p>Optionally, you can configure the reporting system to use Secured Socket\r\nLayer (SSL) communication:</p>", "<p>For more information on enabling the reporting system, refer to the <cite>IBM Tivoli Business Systems Manager Administrator's Guide</cite>.</p>"]},
{"title": "Health Monitor", "description": ["<p>The health monitor service periodically examines the status of key aspects\r\nof your Tivoli<sup>(R)</sup> Business Systems Manager solution:</p>", "<p class=\"indatacontent\">You can use the health monitor client application to view the collected\r\ndata.</p>", "<p>The health monitor service monitoring configuration is stored in the Windows registry on the server where it runs. A setup script is supplied\r\nto help set these values. For more information on configuring the health monitor,\r\nrefer to the <cite>IBM Tivoli Business Systems Manager Administrator's Guide</cite>.</p>"]},
{"title": "Failover", "description": ["<p>You can use the failover process to run your Windows<sup>(R)</sup> servers continuously for a 24x7\r\noperation. The solution consists of two complete and identical sets of servers\r\n(primary and secondary). By maintaining the two sets concurrently, you can\r\nminimize the effect of hardware or database failures, as well as scheduled\r\noutages for maintenance.</p>", "<p>The failover process is accomplished by the following actions:</p>", "<p>The preparation of the two sets of servers for the failover process consists\r\nof these steps:</p>", "<p class=\"indatacontent\">For more information on the failover process, refer to the <cite>IBM Tivoli<sup>(R)</sup> Business Systems Manager Administrator's Guide</cite>.</p>"]},
{"title": "Problem and Change Interface", "description": ["<p>You can create a set of request processors that allows Tivoli<sup>(R)</sup> Business Systems Manager to be integrated\r\nwith your problem and change management applications. The following request\r\ntypes are supported:</p>", "<p class=\"indatacontent\">In each case, Tivoli Business Systems Manager generates an input file that is read by your request\r\nprocessor. The request processor uses the information in the input file to\r\ncall the problem or change management application. After making this call,\r\nthe request processor creates an output file with the results of the call,\r\nand passes the output file back to Tivoli Business Systems Manager. For automatic ticketing, you must\r\nalso define automatic ticket rules to activate the function. For more information\r\non defining these rules, refer to the <cite>IBM Tivoli Business Systems Manager Administrator's Guide</cite>. For more information\r\non request processors, refer to the <cite>IBM Tivoli Business Systems Manager Problem and Change Management Integration Guide</cite>.</p>"]},
{"title": "Finalizing the Solution", "description": ["<p>There are several steps to complete your implementation:</p>", "<p>The implementation team already has the knowledge to use the solution.\r\nMembers of this team are your best choice to instruct those who are to use\r\nthe solution in their day to day activities. This instruction is an ongoing\r\nprocess as you refine your solution.</p>", "<p>Create a solution maintenance plan for the administrators. This includes\r\nnot only the maintenance of individual user and group IDs, but also maintenance\r\nof the solution in the areas of data feeds, business systems, and overall\r\nsystem performance. You should also relate the maintenance of the Tivoli<sup>(R)</sup> Business Systems Manager solution\r\nto your overall change process so that your solution remains up-to-date as\r\nyour business processes change.</p>", "<p>Tivoli Business Systems Manager includes several areas where automatic processes are provided for\r\nday to day activities that keep the servers running well and in sync with\r\nthe data feeds. These processes can be categorized as follows:</p>"]},
{"title": null, "description": ["<p>After initial installation of your Tivoli<sup>(R)</sup> Business Systems Manager solution, follow these steps\r\nto help make your solution more manageable:</p>"]},
{"title": "Change Management", "description": ["<p>Change management is critical to keep your Tivoli<sup>(R)</sup> Business Systems Manager views up-to-date. When\r\nchanges are made to a business system or components that comprise your business\r\nsystem, evaluate your business system views and make any required changes.\r\nThe best way to do this is to modify your change process to include a review\r\nof the impact of the change to your Tivoli Business Systems Manager views.</p>", "<p>Another aspect of change management is recognizing when managed resources\r\nare unavailable due to scheduled maintenance. You can use the Tivoli Business Systems Manager product\r\nto indicate the beginning and ending of a maintenance window for one or more\r\nmanaged resources. This indication is either in the form of a GTMMAINT generic\r\nevent, or as a result of the <span class=\"bold\">gtmmaint</span> command. During\r\nthis maintenance window, affected objects are marked to reflect that they\r\nare in maintenance state, and any events received for the resources are enqueued.\r\nWhen the maintenance window for a resource ends, any queued events are applied\r\nto the resource and its current state set accordingly. For more information,\r\nrefer to the <cite>IBM Tivoli Business Systems Manager Administrator's Guide</cite>.</p>"]},
{"title": "Backup and Recovery", "description": ["<p>All Tivoli<sup>(R)</sup> Business Systems Manager databases should be backed up periodically so that in the event\r\nof a database failure they can be restored quickly.  The recommended approach\r\nfor this is to use the SQL Server Enterprise Manager to define a Database\r\nMaintenance Plan.  This plan should not only back up the databases but also\r\nperform database reorganization for optimum performance as well as a data\r\nintegrity checking.</p>", "<p>You can restore a Tivoli Business Systems Manager database by using the SQL Server Enterprise Manager\r\ngraphical user interface facilities. For more information, refer to the <cite>IBM Tivoli Business Systems Manager Administrator's Guide</cite>.</p>"]},
{"title": "Server Tuning", "description": ["<p>On all Tivoli<sup>(R)</sup> Business Systems Manager servers, set the following options for higher priority processing\r\non the servers: </p>"]},
{"title": "Database Tuning", "description": ["<p>Database performance tuning is critical to the performance of Tivoli<sup>(R)</sup> Business Systems Manager in\r\nlarge environments.  It is important to have a database administrator involved\r\nin the Tivoli Business Systems Manager implementation.  Ensure that adequate server resources are available.\r\nAlso monitor SQL server performance.</p>", "<p>When setting up your database server and history server, you can configure\r\nthe SQL server to take advantage of memory above 2 GB by specifying one of\r\nthe settings in <a href=\"bsms97.htm#sqlbootinit\">Table 18</a>.</p>", "<p>Examine the schedules for SQL jobs.  Stagger the running times of the jobs\r\nwhere possible, and run them at a time when the system is not heavily utilized.</p>"]},
{"title": "Workspace and Event Viewer Tuning", "description": ["<p>When the event viewer is set up in a workspace, use filtering to limit\r\nsearches.  One suggestion is to filter events no older than three hours, with\r\na severity of yellow and red, and to set the refresh interval no less than\r\nthree minutes.</p>"]},
{"title": "Event Data Retention", "description": ["<p>Consider the amount of event data that you want to retain on both the active\r\ndatabase server and on the history server. The amount of data that you retain\r\ndepends on the following factors:</p>", "<p>You can schedule the SQL server job <span class=\"bold\">Delete Old ObjectEvent\r\nRecords</span> to run periodically and delete old event records from the Tivoli<sup>(R)</sup> Business Systems Manager database\r\nserver. By default this job runs weekly with a retention period of 28 days.\r\nYou can adjust these defaults as needed. For more information on this job,\r\nrefer to the <cite>IBM Tivoli Business Systems Manager Administrator's Guide</cite>.</p>", "<p>You can also schedule the SQL server job <span class=\"bold\">Delete Old History\r\nEvents</span> to run periodically to delete old event records from the Tivoli Business Systems Manager history\r\nserver. By default this job runs every 60 days with a retention period of\r\n366 days. You can adjust these defaults as needed. For more information on\r\nthis job, refer to the <cite>IBM Tivoli Business Systems Manager Installation and Configuration Guide</cite>.</p>"]},
{"title": null, "description": ["<p>This appendix provides a sample task list that you can use in designing\r\nyour Tivoli<sup>(R)</sup> Business Systems Manager implementation.</p>"]},
{"title": null, "description": ["<p>This section describes the following options for obtaining support for IBM<sup>(R)</sup> products:</p>"]},
{"title": "Searching knowledge bases", "description": ["<p>If you have a problem with your IBM<sup>(R)</sup> software, you want it resolved quickly.\r\nBegin by searching the available knowledge bases to determine whether the\r\nresolution to your problem is already documented.</p>"]},
{"title": "Search the information center on your local system or network", "description": ["<p>IBM<sup>(R)</sup> provides extensive documentation that can be installed on your local\r\ncomputer or on an intranet server.</p>", "<p>An index is provided for\r\nsearching the Tivoli<sup>(R)</sup> Business Systems Manager library. If you have Adobe Acrobat on your system, you\r\ncan use the Search command to locate specific text in the library. For more\r\ninformation about using the index to search the library, see the online help\r\nfor Acrobat.<a id=\"idx392\" name=\"idx392\"></a><a id=\"idx393\" name=\"idx393\"></a><a id=\"idx394\" name=\"idx394\"></a><a id=\"idx395\" name=\"idx395\"></a></p>"]},
{"title": "Search the Internet", "description": ["<p>If you cannot find an answer to your question in the information center,\r\nsearch the Internet for the latest, most complete information that might help\r\nyou resolve your problem. To search multiple Internet resources for your product,\r\nexpand the product folder in the navigation frame to the left and select <span class=\"bold\">Web search</span>. From this topic, you can search a variety\r\nof resources including:</p>"]},
{"title": "Obtaining fixes", "description": ["<p>A product fix might be available to resolve your problem. You can determine\r\nwhat fixes are available for your IBM<sup>(R)</sup> software product by checking the product\r\nsupport Web site:</p>", "<p class=\"indatacontent\">To receive weekly e-mail notifications about fixes and other news about IBM products,\r\nfollow these steps:</p>", "<p class=\"indatacontent\">For more information about types of fixes, see the <span class=\"italic\">Software Support Handbook</span> (<a href=\"http://techsupport.services.ibm.com/guides/handbook.html\">http://techsupport.services.ibm.com/guides/handbook.html</a>).</p>"]},
{"title": "Contacting IBM Software Support", "description": ["<p>IBM<sup>(R)</sup> Software Support provides assistance with product defects.</p>", "<p>Before contacting IBM Software Support, your company must have an active IBM software\r\nmaintenance contract, and you must be authorized to submit problems to IBM.\r\nThe type of software maintenance contract that you need depends on the type\r\nof product you have:</p>", "<p>If you are not sure what type of software maintenance contract you need,\r\ncall 1-800-IBMSERV (1-800-426-7378) in the United States or, from other countries,\r\ngo to the contacts page of the IBM Software Support Handbook on the Web (<a href=\"http://techsupport.services.ibm.com/guides/contacts.html\">http://techsupport.services.ibm.com/guides/contacts.html</a>) and click the name of your geographic region for phone numbers of people\r\nwho provide support for your location.</p>", "<p>Follow the steps in this topic to contact IBM Software Support:</p>"]},
{"title": "Determine the business impact of your problem", "description": ["<p>When you report a problem to IBM<sup>(R)</sup>, you are asked to supply a severity level.\r\nTherefore, you need to understand and assess the business impact of the problem\r\nyou are reporting. Use the following criteria:</p>"]},
{"title": "Describe your problem and gather background information", "description": ["<p>When explaining a problem to IBM<sup>(R)</sup>, be as specific as possible. Include all\r\nrelevant background information so that IBM Software Support specialists can help\r\nyou solve the problem efficiently. To save time, know the answers to these\r\nquestions:</p>"]},
{"title": "Submit your problem to IBM Software Support", "description": ["<p>You can submit your problem in one of two ways:</p>", "<p>If the problem you submit is for a software defect or for missing or inaccurate\r\ndocumentation, IBM Software Support creates an Authorized Program Analysis\r\nReport (APAR). The APAR describes the problem in detail. Whenever possible, IBM Software\r\nSupport provides a workaround for you to implement until the APAR is resolved\r\nand a fix is delivered. IBM publishes resolved APARs on the IBM product support\r\nWeb pages daily, so that other users who experience the same problem can benefit\r\nfrom the same resolutions.</p>", "<p>For more information about problem resolution, see <a href=\"bsms102.htm#searchingknowledgebases\">Searching knowledge bases</a> and <a href=\"bsms105.htm#obtainingfixes\">Obtaining fixes</a>.</p>"]},
{"title": null, "description": ["<p>This information was developed for products and services offered in the\r\nU.S.A. IBM may not offer the products, services, or features discussed in\r\nthis document in other countries. Consult your local IBM representative for\r\ninformation on the products and services currently available in your area.\r\nAny reference to an IBM product, program, or service is not intended to state\r\nor imply that only that IBM product, program, or service may be used. Any\r\nfunctionally equivalent product, program, or service that does not infringe\r\nany IBM intellectual property right may be used instead. However, it is the\r\nuser's responsibility to evaluate and verify the operation of any non-IBM\r\nproduct, program, or service.</p>", "<p>IBM may have patents or pending patent applications covering subject matter\r\ndescribed in this document. The furnishing of this document does not give\r\nyou any license to these patents. You can send license inquiries, in writing,\r\nto:</p>", "<p>For license inquiries regarding double-byte (DBCS) information, contact\r\nthe IBM<sup>(R)</sup> Intellectual Property Department in your country or send inquiries,\r\nin writing, to:</p>", "<p><span class=\"bold\">The following paragraph does not apply to the United Kingdom\r\nor any other country where such provisions are inconsistent with local law</span>:</p>", "<p>INTERNATIONAL BUSINESS MACHINES CORPORATION PROVIDES  THIS PUBLICATION\r\n\"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING,\r\nBUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY\r\nOR FITNESS FOR A PARTICULAR PURPOSE.</p>", "<p>Some states do not allow disclaimer of express or implied warranties in\r\ncertain transactions, therefore, this statement might not apply to you.</p>", "<p>This information could include technical inaccuracies or typographical\r\nerrors. Changes are periodically made to the information herein; these changes\r\nwill be incorporated in new editions of the publication. IBM may make improvements\r\nand/or changes in the product(s) and/or the program(s) described in this publication\r\nat any time without notice.</p>", "<p>Any references in this information to non-IBM Web sites are provided for\r\nconvenience only and do not in any manner serve as an endorsement of those\r\nWeb sites. The materials at those Web sites are not part of the materials\r\nfor this IBM product and use of those Web sites is at your own risk.</p>", "<p>IBM may use or distribute any of the information you supply in any way\r\nit believes appropriate without incurring any obligation to you.</p>", "<p>Licensees of this program who wish to have information about it for the\r\npurpose of enabling: (i) the exchange of information between independently\r\ncreated programs and other programs (including this one) and (ii) the mutual\r\nuse of the information which has been exchanged, should contact:</p>", "<p>Such information may be available, subject to appropriate terms and conditions,\r\nincluding in some cases payment of a fee.</p>", "<p>The licensed program described in this document and all licensed material\r\navailable for it are provided by IBM under terms of the IBM Customer Agreement,\r\nIBM International Program License Agreement or any equivalent agreement between\r\nus.</p>", "<p>Information concerning non-IBM products was obtained from the suppliers\r\nof those products, their published announcements or other publicly available\r\nsources. IBM has not tested those products and cannot confirm the accuracy of\r\nperformance, compatibility or any other claims related to non-IBM products.\r\nQuestions on the capabilities of non-IBM products should be addressed to the\r\nsuppliers of those products.</p>", "<p>COPYRIGHT LICENSE:</p>", "<p>This information contains sample application programs in source language,\r\nwhich illustrate programming techniques on various operating platforms. You\r\nmay copy, modify, and distribute these sample programs in any form without\r\npayment to IBM, for the purposes of developing, using, marketing or distributing\r\napplication programs conforming to the application programming interface for\r\nthe operating platform for which the sample programs are written. These examples\r\nhave not been thoroughly tested under all conditions. IBM, therefore, cannot\r\nguarantee or imply reliability, serviceability, or function of these programs.</p>", "<p>This publication documents intended Programming Interfaces that allow the\r\ncustomer to write programs  to obtain services of IBM Tivoli<sup>(R)</sup> Business Systems Manager.</p>"]},
{"title": "Trademarks", "description": ["<p>IBM,\r\nthe IBM logo, CICS, CICSPlex, DB2, DB2 Universal Database, developerWorks,\r\nDomino, eServer, IMS, Informix, iSeries, Lotus, MQSeries, MVS,\r\nNetView, Notes, OMEGAMON, OS/390, Passport Advantage, pSeries, Rational, Redbooks,\r\nRMF, SecureWay, Tivoli, the Tivoli logo, Tivoli Enterprise, Tivoli Enterprise\r\nConsole, WebSphere, z/OS, and zSeries are trademarks or registered trademarks\r\nof International Business Machines Corporation in the United States, other\r\ncountries, or both.</p>", "<p>Microsoft and Windows are registered trademarks of Microsoft Corporation\r\nin the United States, other countries, or both.</p>", "<p>UNIX is a registered trademark of The Open Group in the United States and\r\nother countries.</p>", "<p>Other company, product, and service names may be trademarks or service\r\nmarks of others.</p>"]},
{"title": null, "description": []}
]